{
  "title": "Setting Up Your Account on BALL",
  "subtitle": "Get started on your journey to homeownership by creating your BALL account.",
  "steps": [
    {
      "title": "Visit the Registration Page",
      "description": "Navigate to the BALL website at https://ballers.ng/ and locate the 'Register for Free' button. Click on it to proceed to the registration page."
    },
    {
      "title": "Select Your Account Type",
      "description": "On the registration page, choose whether you want to register as a User or a Seller.",
      "substeps": [
        "User",
        "Seller"
      ],
      "image": "/img/docs/user-accounts/register-account-type.png",
      "imageAlt": "Select Account Type Page"
    },
    {
      "title": "Speed Up Your Registration",
      "description": "Please note that you can speed up your registration by signing up with your Google account. Click on the 'Sign up with Google' button to use your Google credentials.",
      "image": "/img/docs/user-accounts/register-google.png",
      "imageAlt": "Register with Google Button"
    },
    {
      "title": "Provide Your Information",
      "description": "Depending on the account type selected, you will be prompted to provide the necessary information. If you are registering as a Buyer, you will provide",
      "substeps": [
        "First Name",
        "Last Name",
        "Email Address",
        "Password",
        "Confirm Password",
        "Phone Number"
      ],
      "image": "/img/docs/user-accounts/register-email-buyer.png",
      "imageAlt": "Buyer Registration"
    },
    {
      "title": "Registering as a BALL VIP",
      "description": "If you are registering as a Seller, you will be prompted to provide the following:",
      "substeps": [
        "Company Name",
        "Company Email Address",
        "Password",
        "Confirm Password",
        "Company Phone Number"
      ],
      "image": "/img/docs/user-accounts/register-email-seller.png",
      "imageAlt": "Seller Registration"
    },
    {
      "title": "Agree to Terms and Conditions",
      "description": "Review BALL's Terms of Service and Privacy Policy, then check the box to indicate that you agree to abide by them. These documents outline your rights and responsibilities as a BALL user."
    },
    {
      "title": "Submit Your Registration",
      "description": "Click the 'Register' button to submit your registration information and create your VIP seller account on BALL."
    },
    {
      "title": "Verify Your Email Address",
      "description": "After providing your information, you will receive an email from BALL with a verification link. Click on the link to verify your email address and activate your account."
    },
    {
      "title": "Verify Your Identity (if required)",
      "description": "In some cases, BALL may require additional verification steps to confirm your identity and ensure the security of your account. This may involve providing additional documents or completing a verification process."
    },
    {
      "title": "Start Exploring!",
      "description": "Congratulations! Your BALL account is now set up and ready to use. Log in to your account to start exploring properties, managing your payments, and connecting with other members of the BALL community."
    }
  ]
}
