{
  "title": "Features and Benefits of BALL",
  "subtitle": "Discover how BALL makes owning your dream home easier and more accessible.",
  "steps": [
    {
      "title": "Quality Homes & Communities",
      "description": "Own a quality home in a well-planned community that offers security and comfort. Choose from a variety of designs, locations, and amenities to suit your preferences."
    },
    {
      "title": "Flexible Payment Plans",
      "description": "Select a payment plan that works for you and your budget. Pay in easy installments or as you go, with milestones marking key steps in your journey to homeownership."
    },
    {
      "title": "Low-Interest Mortgages",
      "description": "Access low-interest mortgages as low as 6% to finance your home ownership. Benefit from the best deals from BALL's trusted financial partners."
    },
    {
      "title": "Bonus Points & Rewards",
      "description": "Earn bonus points and rewards for every payment you make. Redeem your points for various fun and relaxing activities, adding value to your homeownership experience."
    },
    {
      "title": "Security & Accountability",
      "description": "Trust a secure and accountable platform that protects your money and your home. Your payments are secure and insured, ensuring peace of mind throughout the home buying process."
    },
    {
      "title": "Referral Bonuses",
      "description": "Earn money by referring friends and family to BALL. Receive a part of their payments as a thank-you gift for helping them on their journey to homeownership."
    },
    {
      "title": "Real Estate Knowledge",
      "description": "Learn from experts and receive smart tips on real estate. Join exclusive events, webinars, and newsletters to stay updated and informed about the latest trends and insights."
    },
    {
      "title": "Community Support",
      "description": "Join a community of like-minded individuals who share your vision and goals. Network, collaborate, and celebrate with other BALLers on your journey to homeownership."
    }
  ]
}
