{
  "title": "BALL Refer & Earn Programme",
  "externalLinks": [
    {
      "url": "/refer-a-baller",
      "text": "Learn More",
      "color": "primary"
    },
    {
      "url": "/refer-a-baller/terms",
      "text": "Create your Free Account"
    }
  ],
  "subtitle": "Turn your network into income; Earn up to ₦1 million in cash and gifts for every BALLer you bring on board.",
  "steps": [
    {
      "title": "Create (or Log In to) Your Account",
      "description": "Open a free BALL account in seconds. Inside your dashboard you'll see a dedicated “Refer & Earn” section with your unique referral link and code."
    },
    {
      "title": "Share Your Referral Link",
      "description": "Send that link to friends, family, colleagues or anyone dreaming of a quality home with flexible payment plans.",
      "note": {
        "type": "success",
        "text": "Save your referral link and feel free to share it with friends on all social media platforms to maximize your earnings."
      }
    },
    {
      "title": "They Pick a Home & Make Their First Payment",
      "description": "Your referral signs up through your link, chooses their dream property and completes the very first payment.",
      "note": {
        "type": "info",
        "text": "You can keep track of your earnings and referrals anytime on your BALL Refer & Earn page."
      }
    },
    {
      "title": "Cash-In Immediately",
      "description": "As soon as their first payment hits, you qualify for a referral bonus worth up to ₦1,000,000 in cash plus gifts. No need to wait until the house is fully paid off.",
      "note": {
        "type": "info",
        "text": "Your referral rewards (cash and gifts) will be received within 3 days. We'll send you an email to confirm your details and preferred payment account before processing your reward."
      }
    },
    {
      "title": "Track & Repeat",
      "description": "Monitor every referral and payout in real-time from your dashboard, then keep sharing your link to multiply your earnings. ",
      "note": {
        "type": "success",
        "text": "There is no limit to how many BALLers you can refer."
      }
    }
  ]
}
