{
  "title": "Managing Property Listings on BALL",
  "subtitle": "Effortlessly manage and showcase your properties to potential buyers with BALL's intuitive listing management tools.",
  "steps": [
    {
      "title": "Access Your Dashboard",
      "description": "Log in to your BALL account and navigate to your dashboard. Click on the property card or 'Properties' in the sidebar.",
      "image": "/img/docs/vip-accounts/vip-properties-view.png",
      "imageAlt": "View Properties"
    },
    {
      "title": "Add New Property",
      "description": "Click on the 'Add New Property' button to create a new property listing. Fill in the required details, such as property type, location, price, and description, and upload high-quality images to showcase your property effectively.",
      "image": "/img/docs/vip-accounts/vip-properties-add-new.png",
      "imageAlt": "Add New Property",
      "note": [
        {
          "type": "success",
          "text": "High-quality images attract more potential buyers. Make sure your images are clear and well-lit."
        },
        {
          "type": "info",
          "text": "We offer professional Photography services to help you capture your property in the best light. Contact us for more information."
        }
      ]
    },
    {
      "title": "View Existing Property",
      "description": "Examine the details of your listed properties. Make sure that all the information is correct and update any details if necessary.",
      "image": "/img/docs/vip-accounts/vip-properties-manage.png",
      "imageAlt": "View Properties"
    },
    {
      "title": "Property Approval",
      "description": "The exclamation mark icon indicates that your property listing is pending approval. Once approved, your property will be visible to potential buyers. If your property is not approved, review the guidelines and make the necessary changes to meet the requirements.",
      "image": "/img/docs/vip-accounts/vip-properties-unapproved.png",
      "imageAlt": "View Properties"
    },
    {
      "title": "Edit Existing Property",
      "description": "Review and edit your existing property listings as needed. Update property details, photos, pricing information, and descriptions to keep your listings accurate and up to date.",
      "image": "/img/docs/vip-accounts/vip-properties-manage.png",
      "imageAlt": "Manage Properties",
      "note": {
        "type": "warning",
        "text": "Regularly updating your listings helps maintain their relevance and can lead to higher engagement."
      }
    },
    {
      "title": "Remove Sold Properties",
      "description": "Mark properties as sold or remove them from your listings once they have been sold or are no longer available. This helps maintain the relevance and accuracy of your listings for potential buyers.",
      "note": {
        "type": "success",
        "text": "Keeping your listings up-to-date with sold status improves the credibility of your account.",
        "image": "/img/docs/vip-accounts/vip-properties-manage.png",
        "imageAlt": "Manage Properties"
      }
    },
    {
      "title": "Stay Informed with Notifications",
      "description": "Monitor your notifications to receive alerts and updates on listing activity, inquiries, and buyer interactions. Stay informed in real-time and take timely actions to manage and respond to buyer interest effectively."
    }
  ]
}
